package main

import "fmt"

//  正码 反码 补码
// 正数的正码 反码 补码 都相同

// 3
// 正码 0000 0011

// -3
// 正码 1000 0011 (0 表示z正数 1 表示负数)
// 反码 1111 1100 (符号位不变，其余位与正码相反)
// 补码 1111 1101 (符号位不变，补码等于反码 + 1)

func main() {
	// 左移 <<
	// 正数 (原码左移)
	fmt.Println(2 << 2) // 0000 0010 左移两位 0000 1000   ==>(8)
	// 负数 (原码左移)  
	fmt.Println(-2 << 2) // 1000 0010 左移两位 1000 1000  ==>(-8)


	// 右移 >>
	//(正数右移最小值为 0)
	fmt.Println( 2 >> 2)  // 0000 0010 右移两位 0000 0000 最小值为 0
	fmt.Println( 5 >> 2)  // 0000 0101 右移两位 0000 0001 ==> 1
	// (负数右移最小值为 -1)
	fmt.Println(-2 >> 1)  // 1000 0010 右移两位 1000 0000 最小值为 -1 
	fmt.Println(-6 >> 2) // 1000 0111 右移两位 1000 0001 -2
	fmt.Println(-5 >> 2)  // 1000 0101 右移两位 1000 0001 ==> -2
	fmt.Println(10 >> 2)  // 0000 1010 右移两位 0000 0010 ==> 2

}